{
    "title": "Half Sun Salutation",
    "description": "A stretch exercise.",
    "difficulty": "Beginner",
    "content": [
        {
            "type": "section",
            "title": "Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Stand at the front of your mat with your feet hip-width apart and your hands in prayer position at your heart.",
                    "Inhale and raise your arms up overhead, reaching towards the sky.",
                    "Exhale and fold forward, bringing your hands to the mat beside your feet.",
                    "Inhale and lift your chest halfway, bringing your hands to your shins.",
                    "Exhale and fold forward again, bringing your hands back to the mat.",
                    "Inhale and step your left foot back into a lunge position, keeping your right knee bent at a 90-degree angle.",
                    "Exhale and step your right foot back to meet your left foot, coming into a plank position.",
                    "Lower your knees, chest, and chin to the mat, keeping your elbows close to your sides.",
                    "Inhale and slide forward into cobra pose, lifting your chest off the mat and keeping your elbows bent.",
                    "Exhale and press back into downward-facing dog, lifting your hips up and back.",
                    "Inhale and step your left foot forward into a lunge position, keeping your right knee bent at a 90-degree angle.",
                    "Exhale and step your right foot forward to meet your left foot, folding forward over your legs.",
                    "Inhale and rise up to standing, reaching your arms up overhead.",
                    "Exhale and bring your hands back to prayer position at your heart."
                ]
            }
        },
        {
            "type": "section",
            "title": "Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Strengthens shoulders, arms, and core muscles",
                    "Improves balance and body control",
                    "Increases blood flow to the brain, improving focus and concentration",
                    "Helps to overcome fear and build confidence",
                    "Can be a fun and challenging way to switch up your workout routine"
                ]
            }
        },
        {
            "type": "section",
            "title": "Primary Muscles",
            "content": {
                "type": "list",
                "items": [
                    "Hamstrings",
                    "Glutes",
                    "Quadriceps",
                    "Abdominals",
                    "Back muscles",
                    "Shoulders",
                    "Chest muscles",
                    "Triceps"
                ]
            }
        },
        {
            "type": "section",
            "title": "Variations",
            "content": {
                "type": "list",
                "items": [
                    "Full Sun Salutation",
                    "Modified Sun Salutation",
                    "Chair Sun Salutation",
                    "Warrior I Sun Salutation",
                    "Warrior II Sun Salutation",
                    "Warrior III Sun Salutation",
                    "Low Lunge Sun Salutation",
                    "High Lunge Sun Salutation",
                    "Twisted Sun Salutation"
                ]
            }
        }
    ]
}