{
    "title": "Resistance Band Bent Over Rear Delt Fly",
    "content": [
        {
            "type": "image",
            "path": "images/image_0_0.jpg"
        },
        {
            "type": "section",
            "title": "Resistance Band Bent Over Rear Delt Fly Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Attach the resistance band to a sturdy anchor point, such as a door handle or pole.",
                    "Stand facing the anchor point with your feet shoulder-width apart and knees slightly bent.",
                    "Grasp the resistance band with both hands, palms facing each other, and step back until there is tension in the band.",
                    "Keeping your back straight and core engaged, hinge forward at the hips until your torso is parallel to the ground.",
                    "Extend your arms straight down towards the ground, with a slight bend in your elbows.",
                    "Keeping your arms straight, lift them out to the sides until they are parallel to the ground.",
                    "Squeeze your shoulder blades together at the top of the movement, then slowly lower your arms back down to the starting position.",
                    "Repeat for the desired number of repetitions."
                ]
            }
        },
        {
            "type": "image",
            "path": "images/image_2_1.webp"
        },
        {
            "type": "section",
            "title": "Resistance Band Bent Over Rear Delt Fly Form & Visual",
            "content": ""
        },
        {
            "type": "section",
            "title": "Resistance Band Bent Over Rear Delt Fly Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Strengthens glutes, hamstrings, and lower back muscles",
                    "Improves hip mobility and stability",
                    "Helps prevent lower back pain and injury",
                    "Can be done anywhere with a resistance band",
                    "Can be modified for different fitness levels"
                ]
            }
        },
        {
            "type": "section",
            "title": "Resistance Band Bent Over Rear Delt Fly Muscles Worked",
            "content": {
                "type": "list",
                "items": [
                    "Rear deltoids",
                    "Trapezius",
                    "Rhomboids",
                    "Posterior deltoids"
                ]
            }
        },
        {
            "type": "section",
            "title": "Resistance Band Bent Over Rear Delt Fly Variations & Alternatives",
            "content": {
                "type": "list",
                "items": [
                    "Resistance band rear delt fly",
                    "Bent over dumbbell rear delt fly",
                    "Cable rear delt fly",
                    "Seated rear delt fly machine",
                    "Standing rear delt fly machine"
                ]
            }
        }
    ]
}