{
    "title": "Dumbbell Incline Curl",
    "content": [
        {
            "type": "image",
            "path": "images/image_0_0.jpg"
        },
        {
            "type": "section",
            "title": "Dumbbell Incline Curl Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Start by sitting on an incline bench with a dumbbell in each hand.",
                    "Place your feet firmly on the ground and keep your back straight against the bench.",
                    "Extend your arms fully and let the dumbbells hang at your sides.",
                    "Slowly curl the dumbbells up towards your shoulders, keeping your elbows close to your body.",
                    "Pause at the top of the movement and squeeze your biceps.",
                    "Slowly lower the dumbbells back down to the starting position.",
                    "Repeat for the desired number of reps."
                ]
            }
        },
        {
            "type": "image",
            "path": "images/image_2_1.webp"
        },
        {
            "type": "section",
            "title": "Dumbbell Incline Curl Form & Visual",
            "content": ""
        },
        {
            "type": "section",
            "title": "Dumbbell Incline Curl Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Targets the biceps brachii muscle, helping to increase arm strength and size",
                    "Engages the stabilizer muscles in the shoulders and upper back, improving overall upper body stability",
                    "Allows for a greater range of motion compared to traditional bicep curls, leading to increased muscle activation",
                    "Can be easily modified by adjusting the incline of the bench or using different weights, making it suitable for individuals of varying fitness levels",
                    "Can be performed with just a set of dumbbells and an incline bench, making it a convenient exercise to do at home or at the gym"
                ]
            }
        },
        {
            "type": "section",
            "title": "Dumbbell Incline Curl Muscles Worked",
            "content": {
                "type": "list",
                "items": [
                    "Biceps brachii",
                    "Brachialis",
                    "Brachioradialis"
                ]
            }
        },
        {
            "type": "section",
            "title": "Dumbbell Incline Curl Variations & Alternatives",
            "content": {
                "type": "list",
                "items": [
                    "Dumbbell Hammer Curl",
                    "Dumbbell Preacher Curl",
                    "Dumbbell Concentration Curl",
                    "Dumbbell Spider Curl",
                    "Dumbbell Reverse Curl"
                ]
            }
        }
    ]
}