{
    "title": "Dumbbell Decline Triceps Extension",
    "content": [
        {
            "type": "image",
            "path": "images/image_0_1.jpg"
        },
        {
            "type": "section",
            "title": "Dumbbell Decline Triceps Extension Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Start by lying on a decline bench with your feet secured at the end of the bench and your head at the top.",
                    "Hold a dumbbell in each hand with your palms facing each other and your arms extended straight up towards the ceiling.",
                    "Slowly lower the dumbbells towards your ears by bending your elbows, keeping your upper arms stationary.",
                    "Pause for a moment at the bottom of the movement, then slowly raise the dumbbells back up to the starting position.",
                    "Repeat for the desired number of repetitions."
                ]
            }
        },
        {
            "type": "image",
            "path": "images/image_2_1.webp"
        },
        {
            "type": "section",
            "title": "Dumbbell Decline Triceps Extension Form & Visual",
            "content": ""
        },
        {
            "type": "section",
            "title": "Dumbbell Decline Triceps Extension Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Targets the triceps muscles, helping to build strength and definition in the back of the arms",
                    "Engages the core muscles, providing a secondary workout for the abs and obliques",
                    "Allows for a greater range of motion compared to traditional triceps exercises, such as triceps pushdowns or dips",
                    "Can be easily modified by adjusting the weight of the dumbbells or the angle of the bench to increase or decrease the difficulty of the exercise",
                    "Helps to improve overall upper body strength and stability, which can translate to improved performance in other exercises and daily activities"
                ]
            }
        },
        {
            "type": "section",
            "title": "Dumbbell Decline Triceps Extension Muscles Worked",
            "content": {
                "type": "list",
                "items": [
                    "Triceps brachii",
                    "Anconeus"
                ]
            }
        },
        {
            "type": "section",
            "title": "Dumbbell Decline Triceps Extension Variations & Alternatives",
            "content": {
                "type": "list",
                "items": [
                    "Dumbbell Overhead Triceps Extension",
                    "Cable Decline Triceps Extension",
                    "Close-Grip Bench Press",
                    "Skull Crushers",
                    "Triceps Pushdowns"
                ]
            }
        }
    ]
}