{
    "title": "Barbell Front Raise and Pullover",
    "description": "A strength exercise.",
    "difficulty": "Beginner",
    "content": [
        {
            "type": "section",
            "title": "Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Start by standing with your feet shoulder-width apart and holding a barbell with an overhand grip, hands shoulder-width apart.",
                    "Bring the barbell up to shoulder height, keeping your elbows slightly bent.",
                    "Slowly raise the barbell straight up in front of you until your arms are fully extended.",
                    "Hold for a second, then slowly lower the barbell back down to shoulder height.",
                    "Next, lie down on a bench with your head hanging off the end and hold the barbell with an overhand grip, hands shoulder-width apart.",
                    "Slowly lower the barbell behind your head, keeping your arms straight and your elbows locked.",
                    "Once the barbell is behind your head, slowly raise it back up to the starting position.",
                    "Repeat the front raise and pullover for the desired number of reps."
                ]
            }
        },
        {
            "type": "section",
            "title": "Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Targets the anterior deltoids, upper chest, and triceps",
                    "Improves shoulder mobility and stability",
                    "Increases upper body strength and muscle definition",
                    "Engages the core muscles for stability and balance",
                    "Can be modified for different fitness levels and goals"
                ]
            }
        },
        {
            "type": "section",
            "title": "Primary Muscles",
            "content": {
                "type": "list",
                "items": [
                    "Deltoids (anterior)",
                    "Pectoralis major",
                    "Latissimus dorsi",
                    "Triceps brachii",
                    "Rhomboids",
                    "Trapezius (lower fibers)"
                ]
            }
        },
        {
            "type": "section",
            "title": "Variations",
            "content": {
                "type": "list",
                "items": [
                    "Barbell Front Raise and Pullover",
                    "Barbell Front Raise and Dumbbell Pullover",
                    "Dumbbell Front Raise and Barbell Pullover",
                    "Dumbbell Front Raise and Dumbbell Pullover",
                    "Cable Front Raise and Cable Pullover",
                    "Cable Front Raise and Dumbbell Pullover",
                    "Resistance Band Front Raise and Resistance Band Pullover",
                    "Resistance Band Front Raise and Dumbbell Pullover"
                ]
            }
        }
    ]
}