{
    "title": "Kettlebell Bottoms Up Clean From the Hang Position",
    "content": [
        {
            "type": "image",
            "path": "images/image_0_0.jpg"
        },
        {
            "type": "section",
            "title": "Kettlebell Bottoms Up Clean From the Hang Position Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Stand with your feet shoulder-width apart and your kettlebell on the ground in front of you.",
                    "Bend your knees and hinge at your hips to grab the kettlebell with one hand.",
                    "Stand up straight, holding the kettlebell by the handle with your palm facing up.",
                    "Bring the kettlebell up to your shoulder, keeping your elbow close to your body.",
                    "Flip the kettlebell upside down so that the bottom is facing up.",
                    "Hold the kettlebell steady with your wrist and forearm.",
                    "Lower the kettlebell back down to the starting position.",
                    "Repeat for the desired number of reps, then switch hands and repeat on the other side."
                ]
            }
        },
        {
            "type": "image",
            "path": "images/image_2_1.webp"
        },
        {
            "type": "section",
            "title": "Kettlebell Bottoms Up Clean From the Hang Position Form & Visual",
            "content": ""
        },
        {
            "type": "section",
            "title": "Kettlebell Bottoms Up Clean From the Hang Position Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Improves grip strength and forearm endurance",
                    "Increases shoulder stability and mobility",
                    "Develops explosive power in the hips and legs",
                    "Enhances coordination and balance",
                    "Engages multiple muscle groups, including the core, glutes, and back"
                ]
            }
        },
        {
            "type": "section",
            "title": "Kettlebell Bottoms Up Clean From the Hang Position Muscles Worked",
            "content": {
                "type": "list",
                "items": [
                    "Forearms",
                    "Biceps",
                    "Shoulders",
                    "Back",
                    "Core",
                    "Glutes",
                    "Hamstrings"
                ]
            }
        },
        {
            "type": "section",
            "title": "Kettlebell Bottoms Up Clean From the Hang Position Variations & Alternatives",
            "content": {
                "type": "list",
                "items": [
                    "Kettlebell Bottoms Up Clean From The Hang Position with one arm",
                    "Kettlebell Bottoms Up Clean From The Hang Position with both arms",
                    "Kettlebell Bottoms Up Clean From The Hang Position with a heavier weight",
                    "Kettlebell Bottoms Up Clean From The Hang Position with a lighter weight",
                    "Kettlebell Bottoms Up Clean From The Hang Position with a longer pause at the top",
                    "Kettlebell Bottoms Up Clean From The Hang Position with a shorter pause at the top",
                    "Kettlebell Bottoms Up Clean From The Hang Position with a slower tempo",
                    "Kettlebell Bottoms Up Clean From The Hang Position with a faster tempo"
                ]
            }
        }
    ]
}