{
    "title": "Stability Ball Single Leg Squat",
    "content": [
        {
            "type": "image",
            "path": "images/image_0_0.jpg"
        },
        {
            "type": "section",
            "title": "Stability Ball Single Leg Squat Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Start by placing a stability ball against a wall and standing in front of it.",
                    "Place one foot on top of the ball, with the other foot firmly planted on the ground.",
                    "Engage your core and slowly lower your body down into a squat position, keeping your weight on your planted foot.",
                    "As you lower down, allow the ball to roll back with your foot on it, keeping your balance and control.",
                    "Once you reach a comfortable depth, push through your planted foot to rise back up to the starting position.",
                    "Repeat for the desired number of reps, then switch legs and repeat on the other side."
                ]
            }
        },
        {
            "type": "image",
            "path": "images/image_2_1.gif"
        },
        {
            "type": "section",
            "title": "Stability Ball Single Leg Squat Form & Visual",
            "content": ""
        },
        {
            "type": "section",
            "title": "Stability Ball Single Leg Squat Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Improves balance and stability",
                    "Strengthens leg muscles, including quadriceps, hamstrings, and glutes",
                    "Engages core muscles for added stability and strength",
                    "Increases range of motion in hips and knees",
                    "Can be modified for different fitness levels and abilities",
                    "Low-impact exercise that is easy on joints"
                ]
            }
        },
        {
            "type": "section",
            "title": "Stability Ball Single Leg Squat Muscles Worked",
            "content": {
                "type": "list",
                "items": [
                    "Quadriceps",
                    "Glutes",
                    "Hamstrings",
                    "Core",
                    "Calves"
                ]
            }
        },
        {
            "type": "section",
            "title": "Stability Ball Single Leg Squat Variations & Alternatives",
            "content": {
                "type": "list",
                "items": [
                    "Stability Ball Single Leg Squat with Dumbbells",
                    "Stability Ball Single Leg Squat with Resistance Bands",
                    "Stability Ball Single Leg Squat with Medicine Ball",
                    "Stability Ball Single Leg Squat with Bosu Ball",
                    "Stability Ball Single Leg Squat with TRX Suspension Trainer"
                ]
            }
        }
    ]
}