{
    "title": "Barbell Split Jerk",
    "description": "A strength exercise.",
    "difficulty": "Beginner",
    "content": [
        {
            "type": "section",
            "title": "Instructions",
            "content": {
                "type": "steps",
                "items": [
                    "Start by standing with your feet shoulder-width apart, with the barbell resting on your shoulders behind your neck.",
                    "Take a step forward with one foot, and bend both knees to lower your body into a lunge position.",
                    "As you lower your body, press the barbell overhead with your arms fully extended.",
                    "Once you reach the bottom of the lunge, quickly straighten your legs and push off the ground to jump into the air.",
                    "As you jump, switch the position of your feet so that the foot that was in front is now in the back, and vice versa.",
                    "Land softly on the ground with your feet in the new position, and lower the barbell back down to your shoulders.",
                    "Repeat the exercise for the desired number of reps, alternating which foot you step forward with each time."
                ]
            }
        },
        {
            "type": "section",
            "title": "Benefits",
            "content": {
                "type": "list",
                "items": [
                    "Improves overall strength and power in the lower body, specifically the quads, glutes, and hamstrings",
                    "Increases stability and balance, as the exercise requires coordination and control",
                    "Enhances shoulder mobility and stability, as the movement involves pressing the barbell overhead",
                    "Can improve athletic performance in sports that require explosive movements, such as basketball or volleyball",
                    "Can be modified for different fitness levels and goals, such as using lighter weights for beginners or adding more weight for advanced lifters"
                ]
            }
        },
        {
            "type": "section",
            "title": "Primary Muscles",
            "content": {
                "type": "list",
                "items": [
                    "Quadriceps",
                    "Glutes",
                    "Hamstrings",
                    "Calves",
                    "Core",
                    "Shoulders",
                    "Triceps"
                ]
            }
        },
        {
            "type": "section",
            "title": "Variations",
            "content": {
                "type": "list",
                "items": [
                    "Dumbbell Split Jerk",
                    "Kettlebell Split Jerk",
                    "Single Arm Dumbbell Split Jerk",
                    "Single Arm Kettlebell Split Jerk",
                    "Barbell Push Press",
                    "Dumbbell Push Press",
                    "Kettlebell Push Press",
                    "Single Arm Dumbbell Push Press",
                    "Single Arm Kettlebell Push Press"
                ]
            }
        }
    ]
}